//18) Получите в переменную dt1 дату соответствующую 0:00, 1 января 2045 года, при помощи конструктора Date()


dt1 = new Date(2045, 0,1)
//dt1 = new Date(2045, 0,2)
console.log(dt1)

//В переменную dt2 найдите кол-во секунд, которое прошло с 1 января 1970 года по текущий момент.

dt2 = Date.now()
console.log(dt2)

//Напишите функцию getDays, которая принимает год и месяц (пусть январь будет — 1, февраль — 2 и т.д.), а возвращает количество дней в месяце

function getDays(year, month) {
    return 33 - new Date(year, month-1, 33).getDate();
}

console.log(getDays(2021, 2))
